app/controllers/cryptounits_controller.rb

  def show
    @theme = Theme.find(params[:theme_id])
    @cryptounit = @theme.cryptounits.find(params[:id])
---
SELECT * FROM "themes" WHERE ("themes"."id" = 1)
SELECT * FROM "cryptounits" WHERE ("cryptounits"."id" = 4 AND ("cryptounits".theme_id = 1)) ORDER BY title ASC