app/controllers/themes_controller.rb

SELECT * FROM "themes"
---
  def index
    @themes = Theme.all

SELECT "cryptounits".* FROM "cryptounits" WHERE ("cryptounits".theme_id = 1 AND ("cryptounits"."cert" = 't')) ORDER BY title ASC
SELECT * FROM "themes" WHERE ("themes"."id" = 1)
---
  def show
    @theme = Theme.find(params[:id], :include => [:cert_cryptounits])